docs/wiki/Estrutura.md
```mermaid
classDiagram
    class Banco { <<AggregateRoot>> }
    class Conta { <<AggregateRoot>> }
    class CartaoCredito { <<AggregateRoot>> }
    class Periodo { <<ValueObject>> }
    class Transacao { <<AggregateRoot>> }
    class Data { <<ValueObject>> }
    class Reembolso { <<ValueObject>> }
    class Tipo { <<ValueObject>> }
    class Status { <<ValueObject>> }
    class Descricao { <<ValueObject>> }
    class DespesaRecorrente { <<AggregateRoot>> }
    class Categoria { <<AggregateRoot>> }
    class Nome { <<SharedValueObject>> }
    class Dinheiro { <<SharedValueObject>> }
    class Icon { <<SharedValueObject>> }

    CartaoCredito "1" --> "1" Periodo : define ciclo de
    Transacao "1" --> "1" Data : ocorrida em
    Transacao "1" --> "0..1" Reembolso : pode originar
    Transacao "1" --> "1" Tipo : é do tipo
    Transacao "1" --> "1" Status : encontra-se em
    Transacao "1" --> "1" Descricao : detalhada por

    Conta "0..*" --> "1" Banco : domiciliada em
    Conta "1" --> "0..1" Icon : identificada por
    Conta "1" --> "1" Dinheiro : apresenta saldo
    Conta "1" --> "1" Nome : designada como

    CartaoCredito "1" --> "0..1" Icon : utiliza
    CartaoCredito "1" --> "1" Conta : paga fatura via
    CartaoCredito "1" --> "1" Dinheiro : tem limite/saldo
    CartaoCredito "1" --> "1" Nome : apelidado de

    Transacao "0..*" --> "1" Conta : debita/credita em
    Transacao "0..*" --> "0..1" CartaoCredito : ou afeta limite de
    Transacao "1" --> "1" Categoria : classificada em
    Transacao "1" --> "1" Dinheiro : movimenta

    DespesaRecorrente "1" --> "1" Conta : será debitada em
    DespesaRecorrente "1" --> "1" Categoria : pré-classificada como
    DespesaRecorrente "1" --> "1" Nome : nome da regra
    DespesaRecorrente "1" --> "1" Dinheiro : valor estimado

    Categoria "1" --> "0..1" Icon : ilustrada por
    Categoria "1" --> "1" Nome : denominada
    Banco "1" --> "0..1" Icon : ostenta marca
    Banco "1" --> "1" Nome : chamado
```
